docs: adiciona arquitetura
